#Задайте список из нескольких чисел. Напишите программу,
#которая найдёт сумму элементов списка, стоящих на нечётной позиции
#Пример:
#- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

number = [int(x) for x in input().split(' ')]
sum_n = sum([int(x) for x in number[1::2]])
print(sum_n)
