#Напишите программу, которая будет преобразовывать десятичное число в двоичное.
#Пример:
#- 45 -> 101101
#- 3 -> 11
#- 2 -> 10

number = [int(x) for x in input().split(' ')]
print([str(bin(x))[2:] for x in number])